---
type: PromptForFamilyInstancePlacementOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 7
tags: [revit-api, class]
---

# PromptForFamilyInstancePlacementOptions

`Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PromptForFamilyInstancePlacementOptions | — | `` |
| Constructor | PromptForFamilyInstancePlacementOptions | 2015 | `public PromptForFamilyInstancePlacementOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FaceBasedPlacementType | 2017 | `public FaceBasedPlacementType FaceBasedPlacementType { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PlaceAirTerminalOnDuct | 2015 | `public bool PlaceAirTerminalOnDuct { get ; set ; }` |
| Property | SketchGalleryOptions | 2017 | `public SketchGalleryOptions SketchGalleryOptions { get ; set ; }` |